[
    {
        "static_path": "url(img/pop_static.png)",
        "gif_path": "url(./img/pop.gif)",
        "video_link": "https://www.youtube.com/embed/0wp3QdeE17w",
        "title": "Pop-up Flashcards",
        "description": "<p>I attend Japanese classes every weekend to learn the language I wish I learned in my adolescence but one of the main problems I found during classes was that I struggled to retain the vocabulary so I built an application that can help me study even while I work.</p><p>Written in C#, it pops up based on a timer, selects a random word from a vocab list, presents multiple answers in button form and gives a couple chances to get it correct only to minimise and begins the loop again.</p><p>I'm happy with the result as through the use of this tool, I have noticed a tangible improvement on my performance in class and in general.</p>",
        "links": [
            { "icon": "https://img.icons8.com/windows/128/000000/bitbucket.png", "link": "https://bitbucket.org/reiito/popup-flashcard/src/master/" }
        ]
    },
    {
        "static_path": "url(img/website_static.png)",
        "gif_path": "url(./img/website.gif)",
        "video_link": "https://www.youtube.com/embed/ZbTnV0M5qwU",
        "title": "Portfolio Website",
        "description": "<p>\"What is the best way to show your stuff? A website!\"</p><p>I wanted to make one that showed my work front and centre but as cheaply as possible so I decided to make it myself and found it was a good opportunity to learn something new.</p><p>Using only HTML/CSS/JavaScript, I was able to achieve dynamically loaded content for future additions and fully mobile friendly, all hosted for free on GitHub.</p><p>Let me know what you think!</p>",
        "links": [
            { "icon": "https://img.icons8.com/windows/128/000000/github.png", "link": "https://github.com/reiito/PortfolioWebsite" }
        ]
    },
    {
        "static_path": "url(img/corporate_static.png)",
        "gif_path": "url(./img/corporate.gif)",
        "video_link": "https://www.youtube.com/embed/pmqg8F1pbWc",
        "title": "Corporate Automation",
        "description": "<p>As level 1 IT support, my role doesn't require me to do any software development but while fulfilling my duties, I found some of my responsibilities could be automated. With my programming knowledge, I decided to develop solutions to save time and effort.</p><p>One such task was access provisioning via SailPoint’s IdentityNow which is extremely slow and repetitive when provisioning multiple roles at a time. I was not part of the site team and so I couldn’t get access to the backend due to security restrictions. To get around this, I utilised Selenium via C#, to log in, do the work based on user input. I built a GUI with WinForms for input, data, logging, and progress tracking. With the experience from this, I was able to expand to other sites which required similar, repetitive work and applied the same solution. In the end I automated 4 different sites which saved hundreds of hours of manual work.</p><p>Other areas included writing VBA for quick and easy data extraction / email sending which automated repeating reports for the client. Another was writing PowerShell scripts that enabled large scale modifications to users and groups in Active Directory.</p><p>(Unfortunately I am unable to link to the source for security reasons)</p>",
        "links": [
        ]
    },
    {
        "static_path": "url(img/menu_static.png)",
        "gif_path": "url(./img/menu.gif)",
        "video_link": "https://www.youtube.com/embed/VRm-mqGhOUI",
        "title": "Fireborn Menu System",
        "description": "<p>After the fun we had during the global game jam and the demonstration of my knowledge in Unreal Engine, Tyson from Toybox Games contracted me to build a menu system for Fireborn to use during their PAX Australia showcase.</p><p>It took around two weeks to complete and integrate into the existing project with features such as: keyboard/controller support, settings, designer customisable elements, smooth animations, and session persistency.</p><p>I built it in blueprints and created documentation for use by the designer.</p><p>(I cannot link to the source as it is currently under NDA)</p>",
        "links": [
        ]
    },
    {
        "static_path": "url(img/ubg_static.png)",
        "gif_path": "url(./img/ubg.gif)",
        "video_link": "https://www.youtube.com/embed/yyWoBym0i3Y",
        "title": "Melbourne GGJ 2019",
        "description": "<p>Working with a team formed at the IGDA Melbourne meet-ups; we set out to make a homey, relaxing game set in the Australian outback. You traverse the beautiful Northern Territory as a Wedge Tail Eagle, hunting to feed your chicks.</p><p>I was in charge of the player character and the game loop, implementing a flight movement controller that could pick up prey and return them to it's nest.</p>",
        "links": [
            { "icon": "https://img.icons8.com/windows/128/000000/bitbucket.png", "link": "https://bitbucket.org/reiito/untitled-birb-game/src/master/" },
            { "icon": "https://img.icons8.com/windows/128/000000/itch-io.png", "link": "https://toybox-games-studios.itch.io/untitled-birb-game" }
        ]
    },
    {
        "static_path": "url(img/university_static.png)",
        "gif_path": "url(./img/university.gif)",
        "video_link": "https://www.youtube.com/embed/mjNhEnT1Im4",
        "title": "University",
        "description": "<p>There were a myriad of projects completed during my time at university. An unforgiving platformer, a game a week for 10 weeks, a Microsoft Hololens application, a game jam and more.</p><p>While a programmer for all of them, I also took on the roles of designer, producer and lead during development.</p><p>The video informs of my role in each project and I've linked them below to inspect and try.</p>",
        "links": [
            { "icon": "https://img.icons8.com/windows/128/000000/bitbucket.png", "link": "./uni-links.html" },
            { "icon": "https://img.icons8.com/windows/128/000000/itch-io.png", "link": "https://rei-ito.itch.io/rmit-university-collection" }
        ]
    }
]